DataProcessors/МатрицаТалантов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>МатрицаТалантов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/НастройкаМатрицыТалантов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкаМатрицыТалантов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьМатрицуТалантов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВысокаяОценкаЭффективности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СредняяОценкаЭффективности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВысокаяОценкаПотенциала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СредняяОценкаПотенциала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/МатрицаТалантов/Forms/ФормаНастроек/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.НастройкаМатрицыТалантов) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Настройки = РегистрыСведений.НастройкаМатрицыТалантов.СоздатьМенеджерЗаписи();
	Настройки.Прочитать();
	ЗначениеВРеквизитФормы(Настройки, "НастройкаМатрицыТалантов");
	РегистрыСведений.НастройкаМатрицыТалантов.ЗаполнитьШкалыМатрицыТалантов(ЭтаФорма, Настройки);
	
	Если ПравоДоступа("Изменение", Метаданные.Справочники.Виджеты) Тогда
		Элементы.НастройкиОтображенияОтчета.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыШкалаЭффективностиМатрицыТалантов

&НаКлиенте
Процедура ШкалаЭффективностиМатрицыТалантовЗначениеПриИзменении(Элемент)
	
	НастройкаМатрицыТалантов.СредняяОценкаЭффективности = ШкалаЭффективностиМатрицыТалантов[0].Значение;
	НастройкаМатрицыТалантов.ВысокаяОценкаЭффективности = ШкалаЭффективностиМатрицыТалантов[1].Значение;
	ПриИзмененииДанныхШкалы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыШкалаПотенциалаМатрицыТалантов

&НаКлиенте
Процедура ШкалаПотенциалаМатрицыТалантовЗначениеПриИзменении(Элемент)
	
	НастройкаМатрицыТалантов.СредняяОценкаПотенциала = ШкалаПотенциалаМатрицыТалантов[0].Значение;
	НастройкаМатрицыТалантов.ВысокаяОценкаПотенциала = ШкалаПотенциалаМатрицыТалантов[1].Значение;
	ПриИзмененииДанныхШкалы();
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастройкиОтображенияОтчета(Команда)
	
	ПараметрыФормы = Новый Структура("Ключ", ПредопределенноеЗначение("Справочник.ГруппыВиджетов.МатрицаТалантов"));
	ОткрытьФорму("Справочник.ГруппыВиджетов.Форма.ФормаРедактированияВиджетов", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ЗаписатьНастройки();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриИзмененииДанныхШкалы()
	
	РегистрыСведений.НастройкаМатрицыТалантов.ЗаполнитьШкалыМатрицыТалантов(ЭтаФорма, НастройкаМатрицыТалантов);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройки()
	
	Настройки = РегистрыСведений.НастройкаМатрицыТалантов.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Настройки, НастройкаМатрицыТалантов);
	Настройки.Записать();
	
КонецПроцедуры

#КонецОбласти
